app/controllers/events_controller.rb

  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "events" SET "image_file_name" = ?, "starts_at" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["image_file_name", ""], ["starts_at", Sat, 03 May 2014 04:42:00 UTC +00:00], ["updated_at", Thu, 23 Jan 2014 06:12:37 UTC +00:00]]

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("capacity", "created_at", "description", "image_file_name", "location", "name", "price", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)