app/controllers/registrations_controller.rb

  def create
    @registration = @event.registrations.new(registration_params)
    if @registration.save
---
INSERT INTO "registrations" ("created_at", "email", "event_id", "how_heard", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def set_event
  	@event = Event.find(params[:event_id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? ORDER BY "events"."id" ASC LIMIT 1  [["id", 1]]